In [1]:
## PANDAS SERIES ##
import pandas as p

In [2]:
import numpy as np
a=np.array([10,20,30])
s=p.Series(a)

In [3]:
print(s)

0    10
1    20
2    30
dtype: int32

In [4]:
s1=p.Series([10,20,30,40])
s2=p.Series([3,4,5,6])
s1.add(s2)

0    13
1    24
2    35
3    46
dtype: int64

In [5]:
s1.multiply(s2)

0     30
1     80
2    150
3    240
dtype: int64

In [6]:
s1.pow(s2)

0          1000
1        160000
2      24300000
3    4096000000
dtype: int64

In [7]:
s1>s2

0    True
1    True
2    True
3    True
dtype: bool

In [8]:
s1==s2

0    False
1    False
2    False
3    False
dtype: bool

In [9]:
s1.index

RangeIndex(start=0, stop=4, step=1)

In [10]:
s2.array

<PandasArray>
[3, 4, 5, 6]
Length: 4, dtype: int64

In [11]:
s2.values

array([3, 4, 5, 6], dtype=int64)

In [12]:
s2.shape

(4,)

In [13]:
s2.nbytes

32

In [14]:
s2.ndim

1

In [15]:
s1.memory_usage()

160

In [16]:
s1.empty

False

In [17]:
s1.head()

0    10
1    20
2    30
3    40
dtype: int64

In [18]:
s2.tail()

0    3
1    4
2    5
3    6
dtype: int64

In [19]:
s=['a','b','c','d']
obj=p.Series(s,index=[1,2,3,4])
print(obj)

1    a
2    b
3    c
4    d
dtype: object

In [20]:
#pandas
import numpy as np
import pandas as pd
user={"m1":np.random.randint(1,40,10),
      "m2":np.random.randint(1,40,10),
      "m3":np.random.randint(1,40,10)
     }
df=pd.DataFrame(user)
df

   m1  m2  m3
0  28  29  20
1  26  35  13
2  23  39   6
3  19  27  12
4  24  12   2
5  25  16  10
6  24   1  18
7  26  36   7
8  10   2  29
9   7  10  10

In [21]:
print(df.shape)

rows,cols=df.shape
print(rows)
print(cols)

(10, 3)
10
3

In [22]:
df.head()

   m1  m2  m3
0  28  29  20
1  26  35  13
2  23  39   6
3  19  27  12
4  24  12   2

In [23]:
df.head(2)

   m1  m2  m3
0  28  29  20
1  26  35  13

In [24]:
df.tail()

   m1  m2  m3
5  25  16  10
6  24   1  18
7  26  36   7
8  10   2  29
9   7  10  10

In [25]:
df.tail(2)

   m1  m2  m3
8  10   2  29
9   7  10  10

In [26]:
df.columns

Index(['m1', 'm2', 'm3'], dtype='object')

In [27]:
## to acces rows##
df[1:2]

   m1  m2  m3
1  26  35  13

In [28]:
## to acces column names ##
print(df.columns)

Index(['m1', 'm2', 'm3'], dtype='object')

In [29]:
## to access particular column ##
df['m1'] # or df.m1 #

0    28
1    26
2    23
3    19
4    24
5    25
6    24
7    26
8    10
9     7
Name: m1, dtype: int32

In [30]:
df[['m1','m2']]

   m1  m2
0  28  29
1  26  35
2  23  39
3  19  27
4  24  12
5  25  16
6  24   1
7  26  36
8  10   2
9   7  10

In [31]:
## to acces max value from m1 col ##
print(df.m1.max())
 # or #
df['m1'].max()

28

28

In [33]:
## to acces max values from m1,m2 cols ##
df[['m1','m2']].max()

m1    28
m2    39
dtype: int32

In [34]:
## it describes about statistical measures of data in table ##
df.describe()

              m1         m2         m3
count  10.000000  10.000000  10.000000
mean   21.200000  20.700000  12.700000
std     7.130529  14.267679   7.846443
min     7.000000   1.000000   2.000000
25%    20.000000  10.500000   7.750000
50%    24.000000  21.500000  11.000000
75%    25.750000  33.500000  16.750000
max    28.000000  39.000000  29.000000

In [36]:
## to get values from m1 whose values are > 25 ##
df[df['m1']>=25]

   m1  m2  m3
0  28  29  20
1  26  35  13
5  25  16  10
7  26  36   7

In [37]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [38]:
df[df.m1==df['m1'].max()]

   m1  m2  m3
0  28  29  20

In [111]:
df['m1'][df.m1==df['m1'].max()]

0    39
Name: m1, dtype: int32

In [39]:
df.set_index('m1',inplace=True)
df

    m2  m3
m1
28  29  20
26  35  13
23  39   6
19  27  12
24  12   2
25  16  10
24   1  18
26  36   7
10   2  29
7   10  10

In [40]:
df.reset_index(inplace=True) ## inplace is used to modify original df ##

In [41]:
df

   m1  m2  m3
0  28  29  20
1  26  35  13
2  23  39   6
3  19  27  12
4  24  12   2
5  25  16  10
6  24   1  18
7  26  36   7
8  10   2  29
9   7  10  10

In [42]:
### different ways of creating data frame###
##  1) using csv
##  2)dictionary
##  3)using tuples list
## using excel

In [43]:
##  using csv
df=pd.read_csv('marks.csv')
df

   Unnamed: 0  m1  m2  m3
0           0   8  12  12
1           1  22  10   4
2           2   9  31  12
3           3  31  35   8
4           4  33  26   5

In [44]:
## using dictionary

weather_data={
    'day':['1/20/2017','2/21/2017','3/20/2017','4/20/2017'],
    'temperature':[20,34,35,36],
    'windspeed':[5,6,7,8]
}
df=pd.DataFrame(weather_data)
df

         day  temperature  windspeed
0  1/20/2017           20          5
1  2/21/2017           34          6
2  3/20/2017           35          7
3  4/20/2017           36          8

In [45]:
## using tuple list##

weather_data=[
    ('1/2/2018',20,6),
    ('2/20/2018',22,5),
    ('4/5/2020',34,4)
]
df=pd.DataFrame(weather_data,columns=['date','temperature','windspeed'])
df

        date  temperature  windspeed
0   1/2/2018           20          6
1  2/20/2018           22          5
2   4/5/2020           34          4

In [46]:
### reading and writing csv,excel files ##

In [47]:
df=pd.read_csv('data.csv')
df.head()

   Unnamed: 0         A         B         C         D
0           0 -1.557181  0.373416  1.040685 -0.648513
1           1 -0.835872 -0.005259  0.502099 -0.956839
2           2 -0.257153  2.638228 -0.535731 -1.069443
3           3 -0.505502 -0.339260  0.602622 -1.420995
4           4  1.366398 -0.368296  0.642091  1.609680

In [48]:
df=pd.read_csv('data.csv',header=None,names=['A','B','C','D','E'])
df.head(3)

,A,B,C,D,E
0,NaN,A,B,C,D
1,0.0,-1.5571814571211158,0.3734159235916714,1.0406850622674464,-0.6485128170133698
2,1.0,-0.8358716125741477,-0.005259078664677811,0.5020989639290331,-0.9568385744797189

In [49]:
## na_values it is used to convert missed data into NaN ##

In [50]:
## HANDLING MISSING DATA ##

In [51]:
df=pd.read_excel('weather_data.xls')
df

         day  temperature  windspeed   event
0 2017-01-01         32.0        6.0    Rain
1 2017-01-04          NaN        7.0   Sunny
2 2017-01-05         28.0        NaN    Snow
3 2017-01-06          NaN        7.0     NaN
4 2017-01-07         32.0        NaN    Rain
5 2017-01-08         31.0        2.0   Sunny
6 2017-01-09          NaN        NaN     NaN
7 2017-01-10         34.0        8.0  Cloudy
8 2017-01-11         40.0       12.0   Sunny

In [52]:
df.to_csv('weather_data.csv')

In [53]:
df=pd.read_csv('weather_data.csv')
type(df.day[0])

str

In [54]:
# to convert day to date ##
df=pd.read_csv('weather_data.csv',parse_dates=['day'])
type(df.day[0])

pandas._libs.tslibs.timestamps.Timestamp

In [55]:
df.head(3)

   Unnamed: 0        day  temperature  windspeed  event
0           0 2017-01-01         32.0        6.0   Rain
1           1 2017-01-04          NaN        7.0  Sunny
2           2 2017-01-05         28.0        NaN   Snow

In [56]:
del df['Unnamed: 0']

In [57]:
df

         day  temperature  windspeed   event
0 2017-01-01         32.0        6.0    Rain
1 2017-01-04          NaN        7.0   Sunny
2 2017-01-05         28.0        NaN    Snow
3 2017-01-06          NaN        7.0     NaN
4 2017-01-07         32.0        NaN    Rain
5 2017-01-08         31.0        2.0   Sunny
6 2017-01-09          NaN        NaN     NaN
7 2017-01-10         34.0        8.0  Cloudy
8 2017-01-11         40.0       12.0   Sunny

In [58]:
df.set_index('day',inplace=True)
df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04          NaN        7.0   Sunny
2017-01-05         28.0        NaN    Snow
2017-01-06          NaN        7.0     NaN
2017-01-07         32.0        NaN    Rain
2017-01-08         31.0        2.0   Sunny
2017-01-09          NaN        NaN     NaN
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

In [59]:
new_df=df.fillna(0)
new_df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04          0.0        7.0   Sunny
2017-01-05         28.0        0.0    Snow
2017-01-06          0.0        7.0       0
2017-01-07         32.0        0.0    Rain
2017-01-08         31.0        2.0   Sunny
2017-01-09          0.0        0.0       0
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

In [60]:
## to replace with relative values to specific columns ##
new_df=df.fillna({
    'temperature':0,
    'windspeed':0,
    'event':'no event'
})
new_df

            temperature  windspeed     event
day
2017-01-01         32.0        6.0      Rain
2017-01-04          0.0        7.0     Sunny
2017-01-05         28.0        0.0      Snow
2017-01-06          0.0        7.0  no event
2017-01-07         32.0        0.0      Rain
2017-01-08         31.0        2.0     Sunny
2017-01-09          0.0        0.0  no event
2017-01-10         34.0        8.0    Cloudy
2017-01-11         40.0       12.0     Sunny

In [61]:
### we have to replace with better estimate values ##

new_df=df.fillna(method='ffill')  ## ffill:forward fill it replaces previous value ##
                                  ## bfill:backwardfill it replaces next values##
new_df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04         32.0        7.0   Sunny
2017-01-05         28.0        7.0    Snow
2017-01-06         28.0        7.0    Snow
2017-01-07         32.0        7.0    Rain
2017-01-08         31.0        2.0   Sunny
2017-01-09         31.0        2.0   Sunny
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

In [62]:
## interpolate:it fills null values with intermediate value b/w above and below cell ##

In [63]:
new_df=df.interpolate()
new_df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04         30.0        7.0   Sunny
2017-01-05         28.0        7.0    Snow
2017-01-06         30.0        7.0     NaN
2017-01-07         32.0        4.5    Rain
2017-01-08         31.0        2.0   Sunny
2017-01-09         32.5        5.0     NaN
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

In [64]:
new_df=df.interpolate(method='time') ## it replaces value based on time##
new_df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04         29.0        7.0   Sunny
2017-01-05         28.0        7.0    Snow
2017-01-06         30.0        7.0     NaN
2017-01-07         32.0        4.5    Rain
2017-01-08         31.0        2.0   Sunny
2017-01-09         32.5        5.0     NaN
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

In [65]:
new_df=df.dropna()
new_df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-08         31.0        2.0   Sunny
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

In [66]:
new_df=df.dropna(how='all') ## it deletes a row if all are null values##
new_df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04          NaN        7.0   Sunny
2017-01-05         28.0        NaN    Snow
2017-01-06          NaN        7.0     NaN
2017-01-07         32.0        NaN    Rain
2017-01-08         31.0        2.0   Sunny
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

In [67]:
## df.replace(0,np.NaN) ## to replace null values with Nan we can also pass list of values

In [68]:
df=pd.DataFrame({
    'city':['mumbai','delhi','goa','mumbai','mumbai','goa','goa','delhi'],
    'date':['5/1/2012','4/5/2012','3/2/2012','5/6/2012','7/8/2012','8/3/2012','4/5/2012','12/3/2012'],
    'temperature':[30,40,35,45,33,23,22,50],
    'humidity':[45,55,65,45,66,43,23,33],
    'event':['fog','sunny','rainy','sunny','fog','sunny','rainy','sunny']
})
df

     city       date  temperature  humidity  event
0  mumbai   5/1/2012           30        45    fog
1   delhi   4/5/2012           40        55  sunny
2     goa   3/2/2012           35        65  rainy
3  mumbai   5/6/2012           45        45  sunny
4  mumbai   7/8/2012           33        66    fog
5     goa   8/3/2012           23        43  sunny
6     goa   4/5/2012           22        23  rainy
7   delhi  12/3/2012           50        33  sunny

In [69]:
g=df.groupby('city') ## internally it is present in object type ##
g

In [70]:
for city,city_df in g:
    print(city)
    print(city_df)

delhi
    city       date  temperature  humidity  event
1  delhi   4/5/2012           40        55  sunny
7  delhi  12/3/2012           50        33  sunny
goa
  city      date  temperature  humidity  event
2  goa  3/2/2012           35        65  rainy
5  goa  8/3/2012           23        43  sunny
6  goa  4/5/2012           22        23  rainy
mumbai
     city      date  temperature  humidity  event
0  mumbai  5/1/2012           30        45    fog
3  mumbai  5/6/2012           45        45  sunny
4  mumbai  7/8/2012           33        66    fog

In [71]:
g.get_group('mumbai') ## to get specific group ##

     city      date  temperature  humidity  event
0  mumbai  5/1/2012           30        45    fog
3  mumbai  5/6/2012           45        45  sunny
4  mumbai  7/8/2012           33        66    fog

In [74]:
g.max() # to get max value from each group ##

            date  temperature  humidity  event
city
delhi   4/5/2012           50        55  sunny
goa     8/3/2012           35        65  sunny
mumbai  7/8/2012           45        66  sunny

In [75]:
g.describe()

       temperature                                                     \
             count       mean       std   min   25%   50%   75%   max
city
delhi          2.0  45.000000  7.071068  40.0  42.5  45.0  47.5  50.0
goa            3.0  26.666667  7.234178  22.0  22.5  23.0  29.0  35.0
mumbai         3.0  36.000000  7.937254  30.0  31.5  33.0  39.0  45.0

       humidity
          count       mean        std   min   25%   50%   75%   max
city
delhi       2.0  44.000000  15.556349  33.0  38.5  44.0  49.5  55.0
goa         3.0  43.666667  21.007935  23.0  33.0  43.0  54.0  65.0
mumbai      3.0  52.000000  12.124356  45.0  45.0  45.0  55.5  66.0

In [76]:
df.sort_values(by=['temperature'])

     city       date  temperature  humidity  event
6     goa   4/5/2012           22        23  rainy
5     goa   8/3/2012           23        43  sunny
0  mumbai   5/1/2012           30        45    fog
4  mumbai   7/8/2012           33        66    fog
2     goa   3/2/2012           35        65  rainy
1   delhi   4/5/2012           40        55  sunny
3  mumbai   5/6/2012           45        45  sunny
7   delhi  12/3/2012           50        33  sunny

In [77]:
## conactenating ##

In [78]:
weather=pd.DataFrame({
    'city':['mumbai','delhi','goa'],
    'date':['5/1/2012','4/5/2012','3/2/2012'],
    'temperature':[30,40,35],
    'humidity':[45,55,65]
})
weather

     city      date  temperature  humidity
0  mumbai  5/1/2012           30        45
1   delhi  4/5/2012           40        55
2     goa  3/2/2012           35        65

In [79]:
us_weather=pd.DataFrame({
    'city':['mumbai','delhi','goa'],
    'date':['5/1/2012','14/5/2012','13/2/2012'],
    'temperature':[32,44,25],
    'humidity':[15,27,35]
})
us_weather

     city       date  temperature  humidity
0  mumbai   5/1/2012           32        15
1   delhi  14/5/2012           44        27
2     goa  13/2/2012           25        35

In [80]:
df=pd.concat([weather,us_weather])
df

     city       date  temperature  humidity
0  mumbai   5/1/2012           30        45
1   delhi   4/5/2012           40        55
2     goa   3/2/2012           35        65
0  mumbai   5/1/2012           32        15
1   delhi  14/5/2012           44        27
2     goa  13/2/2012           25        35

In [81]:
df=pd.concat([weather,us_weather],ignore_index=True)
df

     city       date  temperature  humidity
0  mumbai   5/1/2012           30        45
1   delhi   4/5/2012           40        55
2     goa   3/2/2012           35        65
3  mumbai   5/1/2012           32        15
4   delhi  14/5/2012           44        27
5     goa  13/2/2012           25        35

In [82]:
df=pd.concat([weather,us_weather],keys=['weather','us_weather'])
df

                city       date  temperature  humidity
weather    0  mumbai   5/1/2012           30        45
           1   delhi   4/5/2012           40        55
           2     goa   3/2/2012           35        65
us_weather 0  mumbai   5/1/2012           32        15
           1   delhi  14/5/2012           44        27
           2     goa  13/2/2012           25        35

In [83]:
df.loc['weather']

     city      date  temperature  humidity
0  mumbai  5/1/2012           30        45
1   delhi  4/5/2012           40        55
2     goa  3/2/2012           35        65

In [84]:
## when we have different col names in both data frames we can use axis##

In [85]:
us=pd.DataFrame({
    'city':['mumbai','delhi','goa','florida'],
    'humidity':[15,27,35,33]
})
us

      city  humidity
0   mumbai        15
1    delhi        27
2      goa        35
3  florida        33

In [86]:
india=pd.DataFrame({
    'city':['mumbai','delhi','goa','hyd'],
    'temperature':[32,44,25,34]
})
india

     city  temperature
0  mumbai           32
1   delhi           44
2     goa           25
3     hyd           34

In [87]:
df=pd.merge(us,india,on='city') ## if we have differnet col names it only takes common columns ##
df

     city  humidity  temperature
0  mumbai        15           32
1   delhi        27           44
2     goa        35           25

In [88]:
df=pd.merge(us,india,on='city',how='outer') ## we can also merge by right,left by default inner ##
df

      city  humidity  temperature
0   mumbai      15.0         32.0
1    delhi      27.0         44.0
2      goa      35.0         25.0
3  florida      33.0          NaN
4      hyd       NaN         34.0

In [89]:
df=pd.merge(us,india,on='city',how='outer',indicator=True) # it tells data from which tables##
df

      city  humidity  temperature      _merge
0   mumbai      15.0         32.0        both
1    delhi      27.0         44.0        both
2      goa      35.0         25.0        both
3  florida      33.0          NaN   left_only
4      hyd       NaN         34.0  right_only

In [90]:
## in loc we have to give coln names for retrieving ,here stop index included
## in iloc we have to give indices for retriving  columns,here stop index not included

In [91]:
df.iloc[0:4,[0,2]]

      city  temperature
0   mumbai         32.0
1    delhi         44.0
2      goa         25.0
3  florida          NaN

In [92]:
df.loc[df['city'].str.contains('m')]

     city  humidity  temperature _merge
0  mumbai      15.0         32.0   both

In [93]:
df.loc[df['city'].str.endswith('i')]

     city  humidity  temperature _merge
0  mumbai      15.0         32.0   both
1   delhi      27.0         44.0   both